espressif/esp-idf/components/soc/esp32p4/include/soc/spi_mem_struct.h
            uint32_t var_dummy                     :    1;  /*Set the bit to enable variable dummy cycle in spi DDR mode.*/
            uint32_t ddr_rdat_swp                  :    1;  /*Set the bit to reorder rx data of the word in spi DDR mode.*/
            uint32_t ddr_wdat_swp                  :    1;  /*Set the bit to reorder tx data of the word in spi DDR mode.*/
            uint32_t ddr_cmd_dis                   :    1;  /*the bit is used to disable dual edge in command phase when DDR mode.*/
            uint32_t outminbytelen                 :    7;  /*It is the minimum output data length in the DDR psram.*/
            uint32_t tx_ddr_msk_en                 :    1;  /*Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when accesses to external RAM.*/
            uint32_t rx_ddr_msk_en                 :    1;  /*Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when accesses to external RAM.*/
            uint32_t usr_ddr_dqs_thd               :    7;  /*The delay number of data strobe which from memory based on SPI clock.*/
            uint32_t ddr_dqs_loop                  :    1;  /*1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and negative edge of SPI_DQS.*/
            uint32_t reserved22                    :    2;  /*reserved*/
            uint32_t clk_diff_en                   :    1;  /*Set this bit to enable the differential SPI_CLK#.*/
            uint32_t reserved25                    :    1;  /*reserved*/
            uint32_t dqs_ca_in                     :    1;  /*Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.*/
            uint32_t hyperbus_dummy_2x             :    1;  /*Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 accesses flash or SPI1 accesses flash or sram.*/
            uint32_t clk_diff_inv                  :    1;  /*Set this bit to invert SPI_DIFF when accesses to external RAM. .*/
            uint32_t octa_ram_addr                 :    1;  /*Set this bit to enable octa_ram address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.*/
            uint32_t hyperbus_ca                   :    1;  /*Set this bit to enable HyperRAM address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.*/
            uint32_t reserved31                    :    1;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_ddr;
    uint32_t reserved_dc;
    uint32_t reserved_e0;
    uint32_t reserved_e4;
    uint32_t reserved_e8;
    uint32_t reserved_ec;
    uint32_t reserved_f0;
    uint32_t reserved_f4;
    uint32_t reserved_f8;
    uint32_t reserved_fc;
    union {
        struct {
            uint32_t fmem_pms0_rd_attr             :    1;  /*1: SPI1 flash PMS section $n read accessible. 0: Not allowed.*/
            uint32_t fmem_pms0_wr_attr             :    1;  /*1: SPI1 flash PMS section $n write accessible. 0: Not allowed.*/
            uint32_t fmem_pms0_ecc                 :    1;  /*SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms0_attr;
    union {
        struct {
            uint32_t fmem_pms1_rd_attr             :    1;  /*1: SPI1 flash PMS section $n read accessible. 0: Not allowed.*/
            uint32_t fmem_pms1_wr_attr             :    1;  /*1: SPI1 flash PMS section $n write accessible. 0: Not allowed.*/
            uint32_t fmem_pms1_ecc                 :    1;  /*SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms1_attr;
    union {
        struct {
            uint32_t fmem_pms2_rd_attr             :    1;  /*1: SPI1 flash PMS section $n read accessible. 0: Not allowed.*/
            uint32_t fmem_pms2_wr_attr             :    1;  /*1: SPI1 flash PMS section $n write accessible. 0: Not allowed.*/
            uint32_t fmem_pms2_ecc                 :    1;  /*SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms2_attr;
    union {
        struct {
            uint32_t fmem_pms3_rd_attr             :    1;  /*1: SPI1 flash PMS section $n read accessible. 0: Not allowed.*/
            uint32_t fmem_pms3_wr_attr             :    1;  /*1: SPI1 flash PMS section $n write accessible. 0: Not allowed.*/
            uint32_t fmem_pms3_ecc                 :    1;  /*SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms3_attr;
    union {
        struct {
            uint32_t fmem_pms0_addr_s              :    26;  /*SPI1 flash PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms0_addr;
    union {
        struct {
            uint32_t fmem_pms1_addr_s              :    26;  /*SPI1 flash PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms1_addr;
    union {
        struct {
            uint32_t fmem_pms2_addr_s              :    26;  /*SPI1 flash PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms2_addr;
    union {
        struct {
            uint32_t fmem_pms3_addr_s              :    26;  /*SPI1 flash PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms3_addr;
    union {
        struct {
            uint32_t fmem_pms0_size                :    14;  /*SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS$n_ADDR_S + SPI_FMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms0_size;
    union {
        struct {
            uint32_t fmem_pms1_size                :    14;  /*SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS$n_ADDR_S + SPI_FMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms1_size;
    union {
        struct {
            uint32_t fmem_pms2_size                :    14;  /*SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS$n_ADDR_S + SPI_FMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms2_size;
    union {
        struct {
            uint32_t fmem_pms3_size                :    14;  /*SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS$n_ADDR_S + SPI_FMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_fmem_pms3_size;
    union {
        struct {
            uint32_t pms0_rd_attr                  :    1;  /*1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed.*/
            uint32_t pms0_wr_attr                  :    1;  /*1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed.*/
            uint32_t pms0_ecc                      :    1;  /*SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG and SPI_SMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms0_attr;
    union {
        struct {
            uint32_t pms1_rd_attr                  :    1;  /*1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed.*/
            uint32_t pms1_wr_attr                  :    1;  /*1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed.*/
            uint32_t pms1_ecc                      :    1;  /*SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG and SPI_SMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms1_attr;
    union {
        struct {
            uint32_t pms2_rd_attr                  :    1;  /*1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed.*/
            uint32_t pms2_wr_attr                  :    1;  /*1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed.*/
            uint32_t pms2_ecc                      :    1;  /*SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG and SPI_SMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms2_attr;
    union {
        struct {
            uint32_t pms3_rd_attr                  :    1;  /*1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed.*/
            uint32_t pms3_wr_attr                  :    1;  /*1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed.*/
            uint32_t pms3_ecc                      :    1;  /*SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG and SPI_SMEM_PMS$n_SIZE_REG.*/
            uint32_t reserved3                     :    29;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms3_attr;
    union {
        struct {
            uint32_t pms0_addr_s                   :    26;  /*SPI1 external RAM PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms0_addr;
    union {
        struct {
            uint32_t pms1_addr_s                   :    26;  /*SPI1 external RAM PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms1_addr;
    union {
        struct {
            uint32_t pms2_addr_s                   :    26;  /*SPI1 external RAM PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms2_addr;
    union {
        struct {
            uint32_t pms3_addr_s                   :    26;  /*SPI1 external RAM PMS section $n start address value*/
            uint32_t reserved26                    :    6;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms3_addr;
    union {
        struct {
            uint32_t pms0_size                     :    14;  /*SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_SMEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms0_size;
    union {
        struct {
            uint32_t pms1_size                     :    14;  /*SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_SMEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms1_size;
    union {
        struct {
            uint32_t pms2_size                     :    14;  /*SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_SMEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms2_size;
    union {
        struct {
            uint32_t pms3_size                     :    14;  /*SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_SMEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE)*/
            uint32_t reserved14                    :    18;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_pms3_size;
    uint32_t reserved_160;
    union {
        struct {
            uint32_t reject_addr                   :    26;  /*This bits show the first SPI1 access error address. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set. */
            uint32_t pm_en                         :    1;  /*Set this bit to enable SPI0/1 transfer permission control function.*/
            uint32_t reserved27                    :    1;  /*reserved*/
            uint32_t pms_ld                        :    1;  /*1: SPI1 write access error. 0: No write access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set. */
            uint32_t pms_st                        :    1;  /*1: SPI1 read access error. 0: No read access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set. */
            uint32_t pms_multi_hit                 :    1;  /*1: SPI1 access is rejected because of address miss. 0: No address miss error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set. */
            uint32_t pms_ivd                       :    1;  /*1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set. */
        };
        uint32_t val;
    } pms_reject;
    union {
        struct {
            uint32_t reserved0                     :    11;  /*reserved*/
            uint32_t ecc_err_int_num               :    6;  /*Set the error times of MSPI ECC read to generate MSPI SPI_MEM_ECC_ERR_INT interrupt.*/
            uint32_t fmem_ecc_err_int_en           :    1;  /*Set this bit to calculate the error times of MSPI ECC read when accesses to flash.*/
            uint32_t fmem_page_size                :    2;  /*Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.*/
            uint32_t fmem_ecc_addr_en              :    1;  /*Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit should be 0. Otherwise, this bit should be 1.*/
            uint32_t usr_ecc_addr_en               :    1;  /*Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.*/
            uint32_t reserved22                    :    2;  /*reserved*/
            uint32_t ecc_continue_record_err_en    :    1;  /*1: The error information in SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR is updated when there is an ECC error. 0: SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR record the first ECC error information.*/
            uint32_t ecc_err_bits                  :    7;  /*Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to byte 0 bit 0 to byte 15 bit 7)*/
        };
        uint32_t val;
    } ecc_ctrl;
    union {
        struct {
            uint32_t ecc_err_addr                  :    26;  /*This bits show the first MSPI ECC error address. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set. */
            uint32_t ecc_err_cnt                   :    6;  /*This bits show the error times of MSPI ECC read. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set. */
        };
        uint32_t val;
    } ecc_err_addr;
    union {
        struct {
            uint32_t axi_err_addr                  :    26;  /*This bits show the first AXI write/read invalid error or AXI write flash error address. It is cleared by when SPI_MEM_AXI_WADDR_ERR_INT_CLR, SPI_MEM_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_AXI_RADDR_ERR_IN_CLR bit is set. */
            uint32_t all_fifo_empty                :    1;  /*The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers and SPI0 transfers are done. 0: Others.*/
            uint32_t reg_rdata_afifo_rempty        :    1;  /*1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.*/
            uint32_t reg_raddr_afifo_rempty        :    1;  /*1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.*/
            uint32_t reg_wdata_afifo_rempty        :    1;  /*1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.*/
            uint32_t reg_wblen_afifo_rempty        :    1;  /*1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.*/
            uint32_t reg_all_axi_trans_afifo_empty :    1;  /*This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and RDATA_AFIFO are empty and spi0_mst_st is IDLE.*/
        };
        uint32_t val;
    } axi_err_addr;
    union {
        struct {
            uint32_t reserved0                     :    17;  /*reserved*/
            uint32_t ecc_err_int_en                :    1;  /*Set this bit to calculate the error times of MSPI ECC read when accesses to external RAM.*/
            uint32_t page_size                     :    2;  /*Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.*/
            uint32_t ecc_addr_en                   :    1;  /*Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of external RAM. If there is no ECC region in external RAM, this bit should be 0. Otherwise, this bit should be 1.*/
            uint32_t reserved21                    :    11;  /*reserved*/
        };
        uint32_t val;
    } spi_smem_ecc_ctrl;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    union {
        struct {
            uint32_t timing_clk_ena                :    1;  /*The bit is used to enable timing adjust clock for all reading operations.*/
            uint32_t timing_cali                   :    1;  /*The bit is used to enable timing auto-calibration for all reading operations.*/
            uint32_t extra_dummy_cyclelen          :    3;  /*add extra dummy spi clock cycle length for spi clock calibration.*/
            uint32_t dll_timing_cali               :    1;  /*Set this bit to enable DLL for timing calibration in DDR mode when accessed to flash.*/
            uint32_t timing_cali_update            :    1;  /*Set this bit to update delay mode, delay num and extra dummy in MSPI.*/
            uint32_t reserved7                     :    25;  /*reserved*/
        };
        uint32_t val;
    } timing_cali;
    union {
        struct {
            uint32_t din0_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the spi_clk high edge,  6: input with the spi_clk low edge*/
            uint32_t din1_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the spi_clk high edge,  6: input with the spi_clk low edge*/
            uint32_t din2_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the spi_clk high edge,  6: input with the spi_clk low edge*/
            uint32_t din3_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the spi_clk high edge,  6: input with the spi_clk low edge*/
            uint32_t din4_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk*/
            uint32_t din5_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk*/
            uint32_t din6_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk*/
            uint32_t din7_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk*/
            uint32_t dins_mode                     :    3;  /*the input signals are delayed by system clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk*/
            uint32_t reserved27                    :    5;  /*reserved*/
        };
        uint32_t val;
    } din_mode;
    union {
        struct {
            uint32_t din0_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din1_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din2_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din3_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din4_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din5_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din6_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t din7_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
            uint32_t dins_num                      :    2;  /*the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...*/
